#### Terraform Plan for `dev` 📋 ✅ Success

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-jorgefk-oblig2-dev]
azurerm_storage_account.main: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-jorgefk-oblig2-dev/providers/Microsoft.Storage/storageAccounts/stoblig2devjorgefk]
azurerm_storage_container.oblig: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-jorgefk-oblig2-dev/providers/Microsoft.Storage/storageAccounts/stoblig2devjorgefk/blobServices/default/containers/oblig-data]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.main has been deleted
  - resource "azurerm_resource_group" "main" {
        id         = "/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-jorgefk-oblig2-dev"
      - location   = "westeurope" -> null
      - name       = "rg-jorgefk-oblig2-dev" -> null
        tags       = {
            "Environment" = "dev"
            "ManagedBy"   = "jorgefk"
            "Project"     = "oblig2"
            "costcode"    = "12345a213414dfg"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_account.main has been deleted
  - resource "azurerm_storage_account" "main" {
      - id                                 = "/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-jorgefk-oblig2-dev/providers/Microsoft.Storage/storageAccounts/stoblig2devjorgefk" -> null
      - name                               = "stoblig2devjorgefk" -> null
      - primary_blob_endpoint              = "https://stoblig2devjorgefk.blob.core.windows.net/" -> null
        tags                               = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Test"        = "TestValue"
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-jfk-oblig2-dev"
      + tags     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "jorgefk"
          + "Project"     = "oblig2"
          + "costcode"    = "sjakalaka"
        }
    }

  # azurerm_storage_account.main will be created
  + resource "azurerm_storage_account" "main" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stoblig2devjfk"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-jfk-oblig2-dev"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "jorgefk"
          + "costcode"    = "sjapalaka"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_container.oblig will be created
  + resource "azurerm_storage_container" "oblig" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "oblig-data"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ resource_group_name      = "rg-jorgefk-oblig2-dev" -> "rg-jfk-oblig2-dev"
  ~ storage_account_endpoint = "https://stoblig2devjorgefk.blob.core.windows.net/" -> (known after apply)
  ~ storage_account_name     = "stoblig2devjorgefk" -> "stoblig2devjfk"
Releasing state lock. This may take a few moments...
```

</details>

**Exit Code:** 0

*Pusher: @jorgenofk, Action: `pull_request`, Workflow: `Terraform CI (Build Once)`*